# GetFieldId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..GetFieldId Method
ScheduleDefinition Class See Also
---
Converts a field index to the corresponding field ID.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ScheduleFieldId GetFieldId(
	int index
)
```

Visual Basic
---
```text
Public Function GetFieldId ( _
	index As Integer _
) As ScheduleFieldId
```

Visual C++
---
```text
public:
ScheduleFieldId^ GetFieldId(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 The field index.
# ### Return Value
The field ID.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | index is not a valid field index in this ScheduleDefinition. |

# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace